#1.有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
#2.求利润
#3.一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
#4.输入某年某月某日，判断这一天是这一年的第几天？
#5.输入三个整数x,y,z，请把这三个数由小到大输出。
#6.斐波那契数列：0、1、1、2、3、5、8、13、21、34、……
#7.将一个列表的数据复制到另一个列表中。
#8.输出 9*9 乘法口诀表。
#9.暂停一秒输出。
#10.暂停一秒输出，并格式化当前时间。
#11.古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？
#12.判断101-200之间有多少个素数，并输出所有素数。
#13.打印出所有的"水仙花数":三位数，其各位数字立方和等于该数本身。
#14.将一个正整数分解质因数
#15.利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学用A表示，60-89分之间的用B表示，60分以下的用C表示。
#16.输出指定格式的日期。使用 datetime 模块。
#17.输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数。
#18.求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。
#19.一个数如果恰好等于它的因子之和，这个数就称为"完数"。例如6=1＋2＋3.编程找出1000以内的所有完数。
#20.一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
#21.猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个
#22.两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，乙队为x,y,z三人。
#23.打印出如下图案（菱形）:
#24.有一分数序列：2/1，3/2，5/3，8/5，13/8，21/13...求出这个数列的前20项之和。
#25.求1+2!+3!+...+20!的和。
#26.利用递归方法求5!。
#27.利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。
#28.有5个人坐在一起，问第五个人多少岁？
#29.给一个不多于5位的正整数，要求：一、求它是几位数，二、逆序打印出各位数字。
#30.一个5位数，判断它是不是回文数。即12321是回文数，个位与万位相同，十位与千位相同。
#31.请输入星期几的第一个字母来判断一下是星期几，如果第一个字母一样，则继续判断第二个字母。
#32.按相反的顺序输出列表的值。
#33.按逗号分隔列表。
#34.练习函数调用。
#35.文本颜色设置。
#36.求100之内的素数。
#37.对10个数进行排序。
#38.求一个3*3矩阵主对角线元素之和。
#39.有一个已经排好序的数组。现输入一个数，要求按原来的规律将它插入数组中。
#40.将一个数组逆序输出
#41.模仿静态变量的用法。
#42.学习使用auto定义变量的用法。
#43.模仿静态变量(static)另一案例。演示一个python作用域使用方法
#44.两个 3 行 3 列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵
#45.统计 1 到 100 之和。
#46.求输入数字的平方，如果平方运算后小于 50 则退出。
#47.两个变量值互换
#48.数字比较。
#49.使用lambda来创建匿名函数。
#50.输出一个随机数。
#51.学习使用按位与 &
#52.学习使用按位或 |
#53.学习使用按位异或 ^
#54.取一个整数a从右端开始的4〜7位。
#55.学习使用按位取反~。
#56.画图，学用circle画圆形
#57.画直线
#58.画方形
#60.计算字符串长度。
#61.打印出杨辉三角形
#62.查找字符串
#63.画椭圆
#66.输入3个数a,b,c，按大小顺序输出
#67.输入数组，最大的与第一个元素交换，最小的与最后一个元素交换，输出数组。
#68.有 n 个整数，使其前面各数顺序向后移 m 个位置，最后 m 个数变成最前面的 m 个数
#69.有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下的是原来第几号的那位。
#70.写一个函数，求一个字符串的长度，在main函数中输入字符串，并输出其长度。
#71.编写input()和output()函数输入，输出5个学生的数据记录。
#72.创建一个链表。
#73.反向输出一个链表
#74.列表排序及连接
#76.编写一个函数，输入n为偶数时，调用函数求1/2+1/4+...+1/n,当输入n为奇数时，调用函数1/1+1/3+...+1/n
#77.循环输出列表
#78.找到年龄最大的人，并输出。请找出程序中有什么问题。
#79.字符串排序
#80.海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子平均分为五份，多了一个，
#81.809*??=800*??+9*?? 其中??代表的两位数,
#82.八进制转换为十进制（进制转换）
#83.求0—7所能组成的奇数个数。
#84.连接字符串
#85.输入一个奇数，然后判断最少几个 9 除于该数的结果为整数
#87.回答结果（结构体变量传递）
#88.读取7个数（1—20）的整数值，每读取一个值，程序打印出该值个数的＊。
#89.某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的，
#90.列表使用实例


#94.时间函数举例4,一个猜数游戏，判断一个人反应快慢。
#95.字符串日期转换为易读的日期格式
#96.计算字符串中子串出现的次数。
#97.从键盘输入一些字符，逐个把它们写到磁盘文件上，直到输入一个 # 为止。
#98.从键盘输入一个字符串，将小写字母全部转换成大写字母，然后输出到一个磁盘文件"test"中保存
#99.有两个磁盘文件A和B,各存放一行字母,要求把这两个文件中的信息合并(按字母顺序排列), 输出到一个新文件C中。
#100.列表转换为字典。